Revit 2027 API
BuiltInFailures.AutoRouteFailures.InappropriateSlopeForPipe Property
 The slope that you specified could not be applied to this pipe. Please check the items that it is connected to and make sure that they aren't constraining the slope of them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InappropriateSlopeForPipe { get; }
Public Shared ReadOnly Property InappropriateSlopeForPipe As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InappropriateSlopeForPipe {
	FailureDefinitionId^ get ();
}
static member InappropriateSlopeForPipe : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace